# 06 - Mengganti Nama (Label) Kolom pada Python Pandas Data Frame

#Import Modules

Module yang digunakan :
1. pandas
2. numpy

In [1]:
import pandas as pd
import numpy as np

-Mengecheck versi dari 2 module yang digunakan (pandas dan numpy)

In [2]:
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

#Membuat sebuah Pandas Data Frame.

-Data frame yang akan dibuat memiliki 5 baris, 5 kolom, serta untuk setiap kolomnya diberi label A, B, C, D, dan E.

-Untuk mebuat labelnya, kita dapat menggunakan tuple yang dikenakan terhadap String.

-ex : String 'ABCDE' yang dikenakan/dikonversi ke tuple akan menghasilkan tuple 'A', 'B', 'C', 'D', dan 'E'.


-pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

-pd.DataFrame() digunakan untuk membuat sebuah objek data frame

-np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols) artinya data frame akan diisi oleh bilangan integer dengan jangkauan 1-10 (1,2,3,4,5,6,7,8,9) yang dipilih secara random. Kemudian, untuk size yang digunakan ditentukan oleh n_rows dan n_cols.

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  8  4  6  1  5
1  6  9  2  9  9
2  2  2  2  5  7
3  1  8  6  5  1
4  1  7  3  6  6

#Mengganti Nama (Label) untuk Sebuah Kolom pada Data Frame

Untuk mengganti nama kolom, kita dapat menggunakan function rename().

Disini kita akan mencoba untuk mengganti nama kolom C menjadi 'Hobi', maka kita dapat menggunakan df.rename(columns={'C' : 'Hobi'}).

Function rename tersebut diberikan parameter berupa columns yang diberikan nilai sebuah dictionary {'C' : 'Hobi'}. 'C' dan 'Hobi' merupakan pasangan key dan value.

In [4]:
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  8  4     6  1  5
1  6  9     2  9  9
2  2  2     2  5  7
3  1  8     6  5  1
4  1  7     3  6  6

#Mengganti Nama (Label) untuk Banyak Kolom pada Data Frame

Disini kita akan mengganti nama kolom A, B, dan D menjadi kolom bernama 'Nama', 'Alamat', dan 'Kota' secara sekaligus. 

Untuk itu, kita dapat menggunakan df.rename(columns={'A' : 'Nama', 'B' : 'Alamat', 'D' : 'Kota'}).

Function rename tersebut diberikan parameter berupa columns yang diberikan nilai sebuah dictionary {'A' : 'Nama', 'B' : 'Alamat', 'D' : 'Kota'}. 

'A' dan 'Nama', 'B' dan 'Alamat', serta 'D' dan 'Kota' merupakan 3 pasangan key dan value.

In [5]:
df.rename(columns={'A' : 'Nama', 'B' : 'Alamat', 'D' : 'Kota'})

   Nama  Alamat  C  Kota  E
0     8       4  6     1  5
1     6       9  2     9  9
2     2       2  2     5  7
3     1       8  6     5  1
4     1       7  3     6  6